embassy-rs/nrf-pac/svd/nrf54l10-app.svd
          <register>
            <name>HWCONFIG</name>
            <description>HwConfig register.</description>
            <addressOffset>0x02C</addressOffset>
            <access>read-write</access>
            <resetValue>0xCC4C8312</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NBSYMKEYS</name>
                <description>Number of Symmetric Keys generated.</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>NBPRIVKEYS</name>
                <description>Number of Private Keys generated.</description>
                <lsb>4</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>IKGCM</name>
                <description>Countermeasures for IKG operations are implemented when 1.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>HWHEALTHTEST</name>
                <description>CTR_DRBG health test is implemented when 1.</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CURVE</name>
                <description>ECC curve for IKG (input).</description>
                <lsb>10</lsb>
                <msb>11</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>P256</name>
                    <description>P256.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>P384</name>
                    <description>P384.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>P521</name>
                    <description>P521.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DF</name>
                <description>Derivation function is implemented in the CTR_DRBG when 1.</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>KEYSIZE</name>
                <description>AES Key Size support for the AES Core embedded in the CTR_DRBG.</description>
                <lsb>13</lsb>
                <msb>15</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AES128</name>
                    <description>supports AES128</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AES192</name>
                    <description>supports AES192</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AES256</name>
                    <description>supports AES256</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ENTROPYINPUTLENGTH</name>
                <description>Value of g_entropy_input_length/32.</description>
                <lsb>16</lsb>
                <msb>19</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>NONCELENGTH</name>
                <description>Value of g_nonce_length/32.</description>
                <lsb>20</lsb>
                <msb>23</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PERSONALIZATIONSTRINGLENGTH</name>
                <description>Value of g_personalization_string_length/32.</description>
                <lsb>24</lsb>
                <msb>27</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ADDITIONALINPUTLENGTH</name>
                <description>Value of g_additional_input_length/32.</description>
                <lsb>28</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral>
      <name>TPIU_NS</name>
      <description>Trace Port Interface Unit</description>
      <baseAddress>0xE0040000</baseAddress>
      <headerStructName>TPIU</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>TPIU</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>UNUSED</name>
          <description>Unused.</description>
          <addressOffset>0x000</addressOffset>
          <resetValue>0x00000000</resetValue>
          <access>read-only</access>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ETM_NS</name>
      <description>Embedded Trace Macrocell</description>
      <baseAddress>0xE0041000</baseAddress>
      <headerStructName>ETM</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>ETM</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>TRCPRGCTLR</name>
          <description>Enables the trace unit.</description>
          <addressOffset>0x004</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Trace unit enable bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The trace unit is disabled. All trace resources are inactive and no trace is generated.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The trace unit is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCPROCSELR</name>
          <description>Controls which PE to trace. Might ignore writes when the trace unit is enabled or not idle. Before writing to this register, ensure that TRCSTATR.IDLE == 1 so that the trace unit can synchronize with the chosen PE. Implemented if TRCIDR3.NUMPROC is greater than zero.</description>
          <addressOffset>0x008</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PROCSEL</name>
              <description>PE select bits that select the PE to trace.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCSTATR</name>
          <description>Idle status bit</description>
          <addressOffset>0x00C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>IDLE</name>
              <description>Trace unit enable bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotIdle</name>
                  <description>The trace unit is not idle.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Idle</name>
                  <description>The trace unit is idle.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMSTABLE</name>
              <description>Programmers' model stable bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotStable</name>
                  <description>The programmers' model is not stable.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Stable</name>
                  <description>The programmers' model is stable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCCONFIGR</name>
          <description>Controls the tracing options This register must always be programmed as part of trace unit initialization. Might ignore writes when the trace unit is enabled or not idle.</description>
          <addressOffset>0x010</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOADASP0INST</name>
              <description>Instruction P0 load field. This field controls whether load instructions are traced as P0 instructions.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>No</name>
                  <description>Do not trace load instructions as P0 instructions.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Yes</name>
                  <description>Trace load instructions as P0 instructions.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOREASP0INST</name>
              <description>Instruction P0 field. This field controls whether store instructions are traced as P0 instructions.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>No</name>
                  <description>Do not trace store instructions as P0 instructions.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Yes</name>
                  <description>Trace store instructions as P0 instructions.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BB</name>
              <description>Branch broadcast mode bit.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Branch broadcast mode is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Branch broadcast mode is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCI</name>
              <description>Cycle counting instruction trace bit.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Cycle counting in the instruction trace is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Cycle counting in the instruction trace is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>Context ID tracing bit.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Context ID tracing is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Context ID tracing is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VMID</name>
              <description>Virtual context identifier tracing bit.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Virtual context identifier tracing is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Virtual context identifier tracing is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COND</name>
              <description>Conditional instruction tracing bit.</description>
              <lsb>8</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Conditional instruction tracing is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LoadOnly</name>
                  <description>Conditional load instructions are traced.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>StoreOnly</name>
                  <description>Conditional store instructions are traced.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LoadAndStore</name>
                  <description>Conditional load and store instructions are traced.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>All</name>
                  <description>All conditional instructions are traced.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TS</name>
              <description>Global timestamp tracing bit.</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Global timestamp tracing is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Global timestamp tracing is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RS</name>
              <description>Return stack enable bit.</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Return stack is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Return stack is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QE</name>
              <description>Q element enable field.</description>
              <lsb>13</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Q elements are disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OnlyWithoutInstCounts</name>
                  <description>Q elements with instruction counts are enabled. Q elements without instruction counts are disabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Q elements with and without instruction counts are enabled.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VMIDOPT</name>
              <description>Control bit to select the Virtual context identifier value used by the trace unit, both for trace generation and in the Virtual context identifier comparators.</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VTTBR_EL2</name>
                  <description>VTTBR_EL2.VMID is used. If the trace unit supports a Virtual context
identifier larger than the VTTBR_EL2.VMID, the upper unused bits are always
zero. If the trace unit supports a Virtual context identifier larger than 8 bits and
if the VTCR_EL2.VS bit forces use of an 8-bit Virtual context identifier, bits
[15:8] of the trace unit Virtual context identifier are always zero.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTEXTIDR_EL2</name>
                  <description>CONTEXTIDR_EL2 is used.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DA</name>
              <description>Data address tracing bit.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Data address tracing is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Data address tracing is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DV</name>
              <description>Data value tracing bit.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Data value tracing is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Data value tracing is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCEVENTCTL0R</name>
          <description>Controls the tracing of arbitrary events. If the selected event occurs a trace element is generated in the trace stream according to the settings in TRCEVENTCTL1R.DATAEN and TRCEVENTCTL1R.INSTEN.</description>
          <addressOffset>0x20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENT</name>
              <description>Select which event should generate trace elements.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
