embassy-rs/nrf-pac/svd/nrf54l10-app.svd
        <register>
          <name>TRCSSCSR0</name>
          <description>Indicates the status of the single-shot comparators. TRCSSCSR0 is sensitive toinstruction addresses.</description>
          <addressOffset>0x2A0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>INST</name>
              <description>Instruction address comparator support</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>False</name>
                  <description>Single-shot instruction address comparisons not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>True</name>
                  <description>Single-shot instruction address comparisons supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DA</name>
              <description>Data address comparator support</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>False</name>
                  <description>Data address comparisons not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>True</name>
                  <description>Data address comparisons supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DV</name>
              <description>Data value comparator support</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>False</name>
                  <description>Data value comparisons not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>True</name>
                  <description>Data value comparisons supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PC</name>
              <description>Process counter value comparator support</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>False</name>
                  <description>Process counter value comparisons not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>True</name>
                  <description>Process counter value comparisons supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS</name>
              <description>Single-shot status. This indicates whether any of the selected comparators have matched.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoMatch</name>
                  <description>Match has not occurred.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Match</name>
                  <description>Match has occurred at least once.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCSSPCICR0</name>
          <description>Selects the processor comparator inputs for Single-shot control.</description>
          <addressOffset>0x2C0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PC_0</name>
              <description>Selects processor comparator 0 inputs for Single-shot control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Processor comparator 0 is not selected for Single-shot control.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Processor comparator 0 is selected for Single-shot control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PC_1</name>
              <description>Selects processor comparator 1 inputs for Single-shot control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Processor comparator 1 is not selected for Single-shot control.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Processor comparator 1 is selected for Single-shot control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PC_2</name>
              <description>Selects processor comparator 2 inputs for Single-shot control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Processor comparator 2 is not selected for Single-shot control.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Processor comparator 2 is selected for Single-shot control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PC_3</name>
              <description>Selects processor comparator 3 inputs for Single-shot control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Processor comparator 3 is not selected for Single-shot control.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Processor comparator 3 is selected for Single-shot control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCPDCR</name>
          <description>Controls the single-shot comparator.</description>
          <addressOffset>0x310</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PU</name>
              <description>Power up request, to request that power to ETM and access to the trace registers is maintained.</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Power not requested.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Power requested.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCPDSR</name>
          <description>Indicates the power down status of the ETM.</description>
          <addressOffset>0x314</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>POWER</name>
              <description>Indicates ETM is powered up</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotPoweredUp</name>
                  <description>ETM is not powered up. All registers are not accessible.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PoweredUp</name>
                  <description>ETM is powered up. All registers are accessible.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STICKYPD</name>
              <description>Sticky power down state. This bit is set to 1 when power to the ETM registers is removed, to indicate that programming state has been lost. It is cleared after a read of the TRCPDSR</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotPoweredDown</name>
                  <description>Trace register power has not been removed since the TRCPDSR was last read.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PoweredDown</name>
                  <description>Trace register power has been removed since the TRCPDSR was last read.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCITATBIDR</name>
          <description>Sets the state of output pins.</description>
          <addressOffset>0xEE4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ID_0</name>
              <description>Drives the ATIDMI[0] output pin.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>ID_1</name>
              <description>Drives the ATIDMI[1] output pin.</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>ID_2</name>
              <description>Drives the ATIDMI[2] output pin.</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>ID_3</name>
              <description>Drives the ATIDMI[3] output pin.</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>ID_4</name>
              <description>Drives the ATIDMI[4] output pin.</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>ID_5</name>
              <description>Drives the ATIDMI[5] output pin.</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>ID_6</name>
              <description>Drives the ATIDMI[6] output pin.</description>
              <lsb>6</lsb>
              <msb>6</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCITIATBINR</name>
          <description>Reads the state of the input pins.</description>
          <addressOffset>0xEF4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATVALID</name>
              <description>Returns the value of the ATVALIDMI input pin.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>AFREADY</name>
              <description>Returns the value of the AFREADYMI input pin.</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCITIATBOUTR</name>
          <description>Sets the state of the output pins.</description>
          <addressOffset>0xEFC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATVALID</name>
              <description>Drives the ATVALIDMI output pin.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>AFREADY</name>
              <description>Drives the AFREADYMI output pin.</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCITCTRL</name>
          <description>Enables topology detection or integration testing, by putting ETM-M33 into integration mode.</description>
          <addressOffset>0xF00</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>IME</name>
              <description>Integration mode enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>ETM is not in integration mode.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>ETM is in integration mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCCLAIMSET</name>
          <description>Sets bits in the claim tag and determines the number of claim tag bits implemented.</description>
          <addressOffset>0xFA0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SET_0</name>
              <description>Claim tag set register</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotSet</name>
                  <description>Claim tag 0 is not set.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Claim tag 0 is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Claim</name>
                  <description>Set claim tag 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SET_1</name>
              <description>Claim tag set register</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotSet</name>
                  <description>Claim tag 1 is not set.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Claim tag 1 is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Claim</name>
                  <description>Set claim tag 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SET_2</name>
              <description>Claim tag set register</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotSet</name>
                  <description>Claim tag 2 is not set.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Claim tag 2 is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Claim</name>
                  <description>Set claim tag 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SET_3</name>
              <description>Claim tag set register</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotSet</name>
                  <description>Claim tag 3 is not set.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Claim tag 3 is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Claim</name>
                  <description>Set claim tag 3.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
