embassy-rs/nrf-pac/svd/nrf54l10-app.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE00_NS">
      <name>GLOBAL_UARTE20_NS</name>
      <description>UART with EasyDMA 2</description>
      <baseAddress>0x400C6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM20_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL20</name>
        <value>198</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM00_NS">
      <name>GLOBAL_SPIM20_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 3</description>
      <baseAddress>0x500C6000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL20</name>
        <value>198</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS00_NS">
      <name>GLOBAL_SPIS20_S</name>
      <description>SPI Slave 3</description>
      <baseAddress>0x500C6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM20_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL20</name>
        <value>198</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM20_NS">
      <name>GLOBAL_TWIM20_S</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 1</description>
      <baseAddress>0x500C6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM20_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL20</name>
        <value>198</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS20_NS">
      <name>GLOBAL_TWIS20_S</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 1</description>
      <baseAddress>0x500C6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM20_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL20</name>
        <value>198</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE00_NS">
      <name>GLOBAL_UARTE20_S</name>
      <description>UART with EasyDMA 3</description>
      <baseAddress>0x500C6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM20_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL20</name>
        <value>198</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM00_NS">
      <name>GLOBAL_SPIM21_NS</name>
      <description>Serial Peripheral Interface Master with EasyDMA 4</description>
      <baseAddress>0x400C7000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL21</name>
        <value>199</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS00_NS">
      <name>GLOBAL_SPIS21_NS</name>
      <description>SPI Slave 4</description>
      <baseAddress>0x400C7000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM21_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL21</name>
        <value>199</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM20_NS">
      <name>GLOBAL_TWIM21_NS</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 2</description>
      <baseAddress>0x400C7000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM21_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL21</name>
        <value>199</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS20_NS">
      <name>GLOBAL_TWIS21_NS</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 2</description>
      <baseAddress>0x400C7000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM21_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL21</name>
        <value>199</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE00_NS">
      <name>GLOBAL_UARTE21_NS</name>
      <description>UART with EasyDMA 4</description>
      <baseAddress>0x400C7000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM21_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL21</name>
        <value>199</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM00_NS">
      <name>GLOBAL_SPIM21_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 5</description>
      <baseAddress>0x500C7000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL21</name>
        <value>199</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS00_NS">
      <name>GLOBAL_SPIS21_S</name>
      <description>SPI Slave 5</description>
      <baseAddress>0x500C7000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM21_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL21</name>
        <value>199</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM20_NS">
      <name>GLOBAL_TWIM21_S</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 3</description>
      <baseAddress>0x500C7000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM21_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL21</name>
        <value>199</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS20_NS">
      <name>GLOBAL_TWIS21_S</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 3</description>
      <baseAddress>0x500C7000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM21_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL21</name>
        <value>199</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE00_NS">
      <name>GLOBAL_UARTE21_S</name>
      <description>UART with EasyDMA 5</description>
      <baseAddress>0x500C7000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM21_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL21</name>
        <value>199</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM00_NS">
      <name>GLOBAL_SPIM22_NS</name>
      <description>Serial Peripheral Interface Master with EasyDMA 6</description>
      <baseAddress>0x400C8000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL22</name>
        <value>200</value>
      </interrupt>
    </peripheral>
