embassy-rs/nrf-pac/svd/nrf54l10-app.svd
    <peripheral derivedFrom="GLOBAL_SPIS00_NS">
      <name>GLOBAL_SPIS22_NS</name>
      <description>SPI Slave 6</description>
      <baseAddress>0x400C8000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM22_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL22</name>
        <value>200</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM20_NS">
      <name>GLOBAL_TWIM22_NS</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 4</description>
      <baseAddress>0x400C8000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM22_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL22</name>
        <value>200</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS20_NS">
      <name>GLOBAL_TWIS22_NS</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 4</description>
      <baseAddress>0x400C8000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM22_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL22</name>
        <value>200</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE00_NS">
      <name>GLOBAL_UARTE22_NS</name>
      <description>UART with EasyDMA 6</description>
      <baseAddress>0x400C8000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM22_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL22</name>
        <value>200</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM00_NS">
      <name>GLOBAL_SPIM22_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 7</description>
      <baseAddress>0x500C8000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL22</name>
        <value>200</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS00_NS">
      <name>GLOBAL_SPIS22_S</name>
      <description>SPI Slave 7</description>
      <baseAddress>0x500C8000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM22_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL22</name>
        <value>200</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM20_NS">
      <name>GLOBAL_TWIM22_S</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 5</description>
      <baseAddress>0x500C8000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM22_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL22</name>
        <value>200</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS20_NS">
      <name>GLOBAL_TWIS22_S</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 5</description>
      <baseAddress>0x500C8000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM22_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL22</name>
        <value>200</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE00_NS">
      <name>GLOBAL_UARTE22_S</name>
      <description>UART with EasyDMA 7</description>
      <baseAddress>0x500C8000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM22_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL22</name>
        <value>200</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_EGU10_NS">
      <name>GLOBAL_EGU20_NS</name>
      <description>Event generator unit 2</description>
      <baseAddress>0x400C9000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>EGU20</name>
        <value>201</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_EGU10_NS">
      <name>GLOBAL_EGU20_S</name>
      <description>Event generator unit 3</description>
      <baseAddress>0x500C9000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>EGU20</name>
        <value>201</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER00_NS">
      <name>GLOBAL_TIMER20_NS</name>
      <description>Timer/Counter 4</description>
      <baseAddress>0x400CA000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER20</name>
        <value>202</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER00_NS">
      <name>GLOBAL_TIMER20_S</name>
      <description>Timer/Counter 5</description>
      <baseAddress>0x500CA000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER20</name>
        <value>202</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER00_NS">
      <name>GLOBAL_TIMER21_NS</name>
      <description>Timer/Counter 6</description>
      <baseAddress>0x400CB000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER21</name>
        <value>203</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER00_NS">
      <name>GLOBAL_TIMER21_S</name>
      <description>Timer/Counter 7</description>
      <baseAddress>0x500CB000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER21</name>
        <value>203</value>
      </interrupt>
    </peripheral>
